examples/soap_publish_message_text.xml

<soap:Envelope 
  xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:oh="urn:openhie.org:alerting"
  xmlns:wsa="http://www.w3.org/2005/08/addressing"

  >
  <soap:Header>
    <wsa:Action soap:mustUnderstand="1" >urn:openhie.org:alerting:2014:Message</wsa:Action>
    <wsa:MessageID>urn:uuid:2c9597f0-4729-11e4-916c-0800200c9a66</wsa:MessageID> <!-- does this duplicate the oh:Message@id ?   -->
    <wsa:ReplyTo soap:mustUnderstand="1">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address> 
    </wsa:ReplyTo>
    <wsa:To soap:mustUnderstand="1">http://host/alertbroker</wsa:To>
    <oh:intended-recipient>
      <oh:query-target type="urn:ihe:iti:csd:2014:stored-function:facility-search">
        <csd:requestParams xmlns:csd="urn:ihe:iti:csd:2013">
          <csd:codedType code="OPC" codingSchema="XXXXXX" />
          <csd:address>
            <csd:addressLine component="city">Chapel Hill</csd:addressLine>
          </csd:address>
        </csd:requestParams>
      </oh:query-target>
      <oh:target id='urn:ecid:1234'>
	<oh:contact-point use-code='CELL' use-code-scheme='http://localhost/EXAMPLE' value='+19195551212'/>
      </oh:target>
    </oh:intended-recipient>
  </soap:Header>
  <soap:Body>
    <oh:message 
	published='2010-11-12T13:14:15Z'
	status-code='Prioirity-Orange'  
	status-code-scheme='CAPS-Example'	
	content-type='text/plan; charset=utf-8'
	xml:lang='en_US'
	>Hello World!</oh:message>    
  </soap:Body>

</soap:Envelope>
